/**
 * @format
 * @type {import('tailwindcss').Config}
 */

module.exports = {
  content: ["./src/**/*.{js,jsx}"],
  darkMode: "class",
  theme: {
    extend: {
      screens: {
        sm: "440px",
        // => @media (min-width: 640px) { ... }

        md: "768px",
        // => @media (min-width: 768px) { ... }
        // StyleCard col-2
        // Header 대신 검색 창

        // LoginPage, SignUpPage 동일
        // Footer사라짐
        // 모든 input, button w-full

        lg: "960px",
        // => @media (min-width: 960px) { ... }
        // StyleaAge
        // StyleTopNav 사라짐 -> 근데 걍 냅두자
        // Bottom에 메뉴 바 생김

        // LoginPage
        // Header 사라짐
      },
      colors: { gray: "#EBEBEB" },
      fontSize: {
        "2xs": " 0.5rem",
        "3xs": " 0.25rem",
      },
      height: {
        "5%": "5%",
        "10%": "10%",
        "20%": "20%",
        "30%": "30%",
        "40%": "40%",
        "50%": "50%",
        "60%": "60%",
        "70%": "70%",
        "80%": "80%",
        "90%": "90%",
        "100%": "100%",
        "110%": "110%",
        "120%": "120%",
      },
      width: {
        "5%": "5%",
        "10%": "10%",
        "20%": "20%",
        "30%": "30%",
        "40%": "40%",
        "50%": "50%",
        "60%": "60%",
        "70%": "70%",
        "80%": "80%",
        "90%": "90%",
      },
      inset: {
        "5%": "5%",
        "10%": "10%",
        "20%": "20%",
        "30%": "30%",
        "40%": "40%",
        "50%": "50%",
        "60%": "60%",
        "70%": "70%",
        "80%": "80%",
        "90%": "90%",
      },
      spacing: {
        "5%": "5%",
        "10%": "10%",
        "11%": "11%",
        "20%": "20%",
        "30%": "30%",
        "40%": "40%",
        "50%": "50%",
        "60%": "60%",
        "70%": "70%",
        "80%": "80%",
        "90%": "90%",
      },
    },
  },
  plugins: [],
};
